package jisx4061

import (
	"testing"
)

func TestLess(t *testing.T) {
	tests := [][]string{
		{
			"０", "１", "２", "３", "４", "５", "６", "７", "８", "９",
		},
		{
			"ａ", "ｂ", "ｃ", "ｄ", "ｅ", "ｆ", "ｇ", "ｈ", "ｉ", "ｊ", "ｋ", "ｌ", "ｍ", "ｎ", "ｏ", "ｐ", "ｑ", "ｒ", "ｓ", "ｔ", "ｕ", "ｖ", "ｗ", "ｘ", "ｙ", "ｚ",
		},
		{
			"Ａ", "Ｂ", "Ｃ", "Ｄ", "Ｅ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ", "Ｋ", "Ｌ", "Ｍ", "Ｎ", "Ｏ", "Ｐ", "Ｑ", "Ｒ", "Ｓ", "Ｔ", "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ", "Ｚ",
		},
		{
			"ａ", "Ａ", "ｚ", "Ｚ",
		},

		// JIS X 4061-1996 参考2 適合性試験データ
		{
			"シャーレ", "シャイ", "シヤィ", "シャレ",
			"ちょこ", "ちよこ", "チョコレート",
			"てーた", "テータ", "テェタ", "てえた", "でーた", "データ", "デェタ", "でえた",
			"チータｇ", "テェタＧ", "てぇたｇ", "てぇたＧ",
		},
	}
	Less("ａ", "Ａ")
	for _, tt := range tests {
		for i, a := range tt {
			for j, b := range tt {
				got := Less(a, b)
				want := i < j
				if got != want {
					t.Errorf("want %s < %s is %t, but not", a, b, want)
				}
			}
		}
	}
}
