package jisx4061

import (
	"testing"
)

func TestLess(t *testing.T) {
	tests := [][]string{
		{
			"０", "１", "２", "３", "４", "５", "６", "７", "８", "９",
		},
		{
			"ａ", "ｂ", "ｃ", "ｄ", "ｅ", "ｆ", "ｇ", "ｈ", "ｉ", "ｊ", "ｋ", "ｌ", "ｍ", "ｎ", "ｏ", "ｐ", "ｑ", "ｒ", "ｓ", "ｔ", "ｕ", "ｖ", "ｗ", "ｘ", "ｙ", "ｚ",
		},
		{
			"Ａ", "Ｂ", "Ｃ", "Ｄ", "Ｅ", "Ｆ", "Ｇ", "Ｈ", "Ｉ", "Ｊ", "Ｋ", "Ｌ", "Ｍ", "Ｎ", "Ｏ", "Ｐ", "Ｑ", "Ｒ", "Ｓ", "Ｔ", "Ｕ", "Ｖ", "Ｗ", "Ｘ", "Ｙ", "Ｚ",
		},
		{
			"ａ", "Ａ", "ｚ", "Ｚ",
		},
		{
			"a", "aa",
		},

		// JIS X 4061-1996 参考2 適合性試験データ
		{
			"∞ｒ∞", "∞Ｒ＃", "∞ｔ∞", "＃ｒ∞", "＃Ｒ＃", "＃ｔ％", "＃Ｔ％",
			"８ｔ∞", "８Ｔ∞", "８ｔ＃", "８Ｔ＃", "８ｔ％", "８Ｔ％",
			"８ｔ８", "８Ｔ８", "ωｒ∞", "ΩＲ％",
			"ｒｒ∞", "ｒＲ∞", "Ｒｒ∞", "ＲＲ∞", "ＲＴ％",
			"ｒｔ８", "ｔｒ∞", "ｔｒ８", "ＴＲ８", "ｔｔ８",
			"シャーレ", "シャイ", "シヤィ", "シャレ",
			"ちょこ", "ちよこ", "チョコレート",
			"てーた", "テータ", "テェタ", "てえた", "でーた", "データ", "デェタ", "でえた",
			"テータｇ", "テェタＧ",
			// "てぇたｇ", "てぇたＧ", // I had not understood why they are this order :(
			"てーたー", "テータァ", "てーたあ", "テェター", "てぇたぁ", "てえたー", "でーたー", "データァ",
			"でェたァ", "デぇタぁ", "デエタア",
			"ひゆ", "びゅあ", "ぴゅあ", "びゅあー", "ビュアー", "ぴゅあー", "ピュアー",
			"ヒュウ", "ヒユウ", "ビュウア",
			// "びゆーあー", // I had not understood why they are this order :(
			"ビューアー", "ひゅん", "ぴゅん",
			"ふーり", "フーリ", "ふぅリ", "ふゥり", "ふゥリ", "フウリ",
			"ブゥり", "ぶうり", "プウリ", "フーリー", "フゥリー", "ふゥりィ", "フぅりぃ", "フウリー", "ふうりぃ", "ブウリイ",
			"ぷーりー", "ぷゥりイ", "ぷうりー", "プウリイ",
			"フヽ", "ふゞ", "ぶゝ", "ぶふ", "ぶフ", "ブふ", "ブフ", "ぶぷ", "ブぷ", "ぷゝ", "ぷヽ", "ぷふ",
		},
	}
	for _, tt := range tests {
		for i, a := range tt {
			for j, b := range tt {
				got := Less(a, b)
				want := i < j
				if got != want {
					t.Errorf("want %s < %s is %t, but not", a, b, want)
				}
			}
		}
	}
}
